Revit 2027 API
DetailElementOrderUtils.BringToFront Method
Overload List
Name | Description
BringToFront(Document, View, ElementId) |  Places the given detail instance in the front of all other detail instances in the view.
BringToFront(Document, View, ICollection<ElementId>) |  Places the given detail instances in the front of all other detail instances in the view, while keeping the order of the given ones.
Top
See Also
Reference
DetailElementOrderUtils Class
Autodesk.Revit.DB Namespace